{
    "version": "https://jsonfeed.org/version/1",
    "title": "Ortho lab logs!!",
    "description": "",
    "home_page_url": "https://chrischrislolo.github.io/orthoLabLogs",
    "feed_url": "https://chrischrislolo.github.io/orthoLabLogs/feed.json",
    "user_comment": "",
    "icon": "https://chrischrislolo.github.io/orthoLabLogs/media/website/Untitled-91.svg",
    "author": {
        "name": "sporewoh"
    },
    "items": [
        {
            "id": "https://chrischrislolo.github.io/orthoLabLogs/pocket-keyboard-design-contest-00.html",
            "url": "https://chrischrislolo.github.io/orthoLabLogs/pocket-keyboard-design-contest-00.html",
            "title": "pocket keyboard design contest #00",
            "summary": "Purpose Outline details, rules, and prizes of the first ever pocket keyboard design contest. Mechanical keyboards are an fun way to interface with a computer thanks to their premium sound and feel. One draw back of many mechanical keyboards, however, is that many of them&hellip;",
            "content_html": "<h1 id=\"purpose\">Purpose</h1>\n<p>Outline details, rules, and prizes of the first ever pocket keyboard design contest.</p>\n<h1 id=\"outline\">Outline</h1>\n<p>Mechanical keyboards are an fun way to interface with a computer thanks to their premium sound and feel. One draw back of many mechanical keyboards, however, is that many of them are difficult to commute with and use on the go. A niche of keyboards that addresses this problem are pocket keyboards.</p>\n<p>A pocket keyboards can vary in shape in size, though they are roughly outlined as any keyboard that can fit inside of your pocket. They are extremely portable, and are perfect for commuting and on the go usage. They are also a viable alternative to a traditional mechanical keyboard for everyday use and programming.</p>\n<p>This design competition is to design a keyboard that fits within your pocket and can be used for everyday typing tasks.</p>\n<p>Big thank you to <a href=\"https://www.pcbway.com/\">PCBWay</a> for generously sponsoring the prizes for this design competition!</p>\n<h1 id=\"timeline\">Timeline</h1>\n<p>The contest begins on <strong>May 15</strong>. Entrants have until <strong>August 15 5:00 AM UTC</strong> to submit a new design or modification for a pocket keyboard.</p>\n<p>There will then be a judging period until <strong>September 15th</strong>, after which winners will be determined. Shipping of prizes will occur by around <strong>November 15th</strong>.</p>\n<h1 id=\"rules\">Rules</h1>\n<ul>\n<li>All entries should be keyboards that can connect to a computer</li>\n<li>The keyboard should fit within a 190mm x 76mm x 22mm bounding box. It should also be possible to type atleast 30+ wpm on the keyboard.</li>\n<li>The combined volume of any split keyboard must also fit within this bounding box</li>\n<li>It should be possible to type all characters, numbers, and symbols on the keyboard.</li>\n<li>Up to 2 entries per contestant allowed, a contestant may only win up to 1 prize.</li>\n<li>New keyboard designs are <em>highly encouraged</em>, though designs that you have worked on prior to the competition are allowed.</li>\n<li>All entries valid will be submitted for the chance to win the entry raffle prize.</li>\n<li>Rules and scoring criteria are be subject to change.</li>\n<li>Judge(s) decisions are final.</li>\n<li>Have fun! This event is to celebrate the extreme end of small keyboards</li>\n</ul>\n<h1 id=\"how-to-enter\">How to enter</h1>\n<p>Create an entry by making a new design, and publishing the design along with a writeup and the source files.</p>\n<p>The write up and source files can be hosted on any platform (e.g. Hackster, Hackaday, the <a href=\"https://www.pcbway.com/project/\">PCBWay Community</a>, or on Github). The writeup should include design choices you made and features with the project. The writeup can include information about the layout if a non-standard one has been used. The writeup will play a considerable role in helping judges score your project, and should contain information that will help with scoring and judging.</p>\n<p>Once you have your writeup ready, you can then enter it by sharing it in the #design-competition-entries channel in my discord here: <a href=\"https://discord.com/invite/m8vwnqJEsc\">https://discord.com/invite/m8vwnqJEsc</a></p>\n<h1 id=\"prizes\">Prizes</h1>\n<p>There are currently 6 prizes available.</p>\n<p><strong>Grand Prize (1)</strong>: $200 PCBWay credit, 1 bancouver40 kit (pcb+aluminum case), 1 PCBWay coaster, 1 PCBWay ruler, 1 idawgz32 kit, stickers</p>\n<p><strong>Runner up prizes (4)</strong>: $50 PCBWay credit, 1 PCBWay Coaster, 1 PCBWay ruler, 1 idawgz32 kit, stickers</p>\n<p><strong>Entry raffle prize (1)</strong>: 1 idawgz32 kit</p>\n<h2 id=\"scoring-criteria\">Scoring Criteria</h2>\n<p>An ideal entry should fit within a pocket, be a viable alternative to a full sized keyboard, be innovative in its design, and should be easily reproducible by others.</p>\n<p>The scoring criteria is roughly as follows:</p>\n<p><strong>Novelty and Innovation</strong> - The design should be a novel solution to a portable keyboard. Any novel features, gimmicks, or ideas in an entry will be rewarded points.</p>\n<p><strong>Size/Portability</strong> - The keyboard should fit within a pocket. This means that a keyboard must fit within a 190mm x 76mm x 22mm bounding box. More points are awarded the smaller and more portable a keyboard is.</p>\n<p><strong>Viability</strong> - It should be ideally possible to type on the keyboard as fast as a normal keyboard. A monkeytype wpm of atleast 20+ should be doable. Higher words per minutes (50+ wpm) will be awarded additional points. </p>\n<p>It should also be possible to use this keyboard for everyday typing tasks (word editing, programming, etc.). The available character set (number, symbols, modifiers, etc.) will also affect the viability score.</p>\n<p><strong>Reproducibility</strong> - The design should ideally have a clear way as how it can be reproduced by others. Points are earned by having an open source design, reproducible steps, and source/manufacturing files ready to be used. BOM cost and simplicity of replication steps can also affect the reproducibility score.</p>\n<p><strong>Presentation</strong> - The ideal design should look generally appealing when being used. Points will be awarded to entries that have nice enclosure or a visually striking layout. Due to the subjectivity of aesthetics, less weighting is applied to this criteria. </p>\n<h1 id=\"inspiration\">Inspiration</h1>\n<p>There are a few ways in which to reduce the size of a mechanical keyboard. Here is a list of some (but not all) techniques that can be used, as well as some example projects:</p>\n<ul>\n<li><p><strong>Fewer keys</strong>: A smaller sized keyboard can be done by using fewer keys in conjunction with a powerful keyboard layout. E.g. <a href=\"https://www.youtube.com/watch?v=5RN_4PQ0j1A\">Keyboards</a> by Ben Vallack, the <a href=\"https://github.com/kilipan/zilpzalp\">ZilpZalp</a> by kilipan, <a href=\"https://github.com/artseyio/thepaintbrush\">The Paintbrush</a> from artseyio (though raw ARTSEY boards as-is may have a reduced novelty score due to their popularity), and the <a href=\"https://github.com/ChrisChrisLoLo/idawgz32\">idawgz32</a></p>\n</li>\n<li><p><strong>Tighter key spacing</strong>: It’s possible to fit more keys in a tight space if you play the keys closer than they normally should be. For example, you can space out the MX keys into a 16mm x 16mm grid rather than the typical 19.05mm x 19.05mm grid that they’re usually in. E.g. the <a href=\"https://github.com/kilipan/zilpzalp\">ZilpZalp</a> by kilipan, and the <a href=\"https://github.com/ChrisChrisLoLo/bancouver40\">bancouver40</a></p>\n</li>\n<li><p><strong>Alternative keys</strong>: An easy way of reducing space is to use switches found in mice rather than switches found in keyboards. E.g. the <a href=\"https://github.com/ChrisChrisLoLo/pusheenz40\">pusheenz40</a> and the <a href=\"https://github.com/ChrisChrisLoLo/bunchiez40\">bunchiez40</a>. See here for some small write ups on finding an ideal alternative switch, see: <a href=\"https://chrischrislolo.github.io/orthoLabLogs/pusheenz40.html\">https://chrischrislolo.github.io/orthoLabLogs/pusheenz40.html</a>, <a href=\"https://chrischrislolo.github.io/orthoLabLogs/bunchiez40-how-i-built-a-keyboard-using-mouse-switches.html\">https://chrischrislolo.github.io/orthoLabLogs/bunchiez40-how-i-built-a-keyboard-using-mouse-switches.html</a></p>\n</li>\n</ul>\n<h1 id=\"terms-and-conditions\">Terms and conditions</h1>\n<p>Shipping of prizes within Canada is free, winners who need international shipping for any prizes won will need to pay for shipping.</p>\n<p>Terms and conditions, rules, scoring criteria, etc. may be subject to change.</p>\n<h1 id=\"acknowledgements\">Acknowledgements</h1>\n<p>Thank you <a href=\"https://www.pcbway.com/\">PCBWay</a> for sponsoring this competition! This would not have been possible without your support! </p>\n",
            "image": "https://chrischrislolo.github.io/orthoLabLogs/media/posts/11/PXL_20240225_201119535.jpg",
            "author": {
                "name": "sporewoh"
            },
            "tags": [
            ],
            "date_published": "2024-05-15T22:50:12-05:00",
            "date_modified": "2024-05-15T23:04:59-05:00"
        },
        {
            "id": "https://chrischrislolo.github.io/orthoLabLogs/idawgs32-how-i-made-a-full-keyboard-for-dollar6.html",
            "url": "https://chrischrislolo.github.io/orthoLabLogs/idawgs32-how-i-made-a-full-keyboard-for-dollar6.html",
            "title": "idawgz32 (how I made a keyboard for only $5)",
            "summary": "Purpose Discuss design considerations when designing a cost optimized keyboard. Showcase my newest keybaord, the idawgz32, as well as talk about the pros and cons of the board. Discuss my experience using FAK. There's been a huge wave of keyboards using the CH552 microcontroller following&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/PXL_20240225_223509158.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_223509158-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_223509158-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_223509158-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_223509158-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_223509158-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_223509158-2xl.jpg 1600w\"></figure>\n<h1>Purpose</h1>\n<p>Discuss design considerations when designing a cost optimized keyboard. Showcase my newest keybaord, the idawgz32, as well as talk about the pros and cons of the board. Discuss my experience using FAK.</p>\n<h1>Preface</h1>\n<p>There's been a huge wave of keyboards using the <a href=\"https://www.lcsc.com/product-detail/USB-ICs_WCH-Jiangsu-Qin-Heng-CH552T_C111367.html\">CH552</a> microcontroller following the release of the <a href=\"https://github.com/semickolon/fak\">FAK keyboard firmware</a>. The two biggest advantages to the CH552 over similar other MCUs is that they only cost a mere $0.69 CAD, in addition to the fact that it doesn't require any external crystals, voltage regulators, or flash modules, making it even more cost effective and simple to design for. To quote the creator, <a href=\"https://github.com/semickolon\">semickolon</a>:</p>\n<blockquote>\n<p>I live in a country where Pi Picos and Pro Micros are not considered cheap. When I began the search for making keyboards as cheap as possible, I discovered CH55x chips which are <em>much</em> cheaper. RP2040 needs an external QSPI flash. ATmega32U4 needs an external clock. As for the CH55x however, all you need to get it running is the chip itself and two capacitors. You can get a complete MCU for less than a dollar.</p>\n</blockquote>\n<p>The idea of large cost savings got me excited with the idea of making a board so cheap that I could give it away for free as a small gift at meetups or the like. As such, I wanted to see if I could make a board, switches and all, that roughly targeted the $5-$6 price range. I also thought it would be fun to give away a board roughly the size of my <a href=\"https://chrischrislolo.github.io/orthoLabLogs/pusheenz40.html\">pusheenz40</a>, since it's size was close to that of a business card.</p>\n<h1>Research</h1>\n<p>I wanted to make sure I was optimizing in the right places, since one of the greatest sins of a engineer is prematurely optimizing or optimizing for the wrong metric. I therefore did a rough cost calculation pie chart of my recent <a href=\"https://chrischrislolo.github.io/orthoLabLogs/pusheenz40.html\">pusheenz40</a> to understand where most of the cost was coming from.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/Screenshot_2024-01-19_at_8.32.16_PM.webp\" alt=\"\" width=\"789\" height=\"405\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot_2024-01-19_at_8.32.16_PM-xs.webp 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot_2024-01-19_at_8.32.16_PM-sm.webp 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot_2024-01-19_at_8.32.16_PM-md.webp 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot_2024-01-19_at_8.32.16_PM-lg.webp 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot_2024-01-19_at_8.32.16_PM-xl.webp 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot_2024-01-19_at_8.32.16_PM-2xl.webp 1600w\">\n<figcaption >Quick and messy cost breakdown pie chart of my pusheenz40</figcaption>\n</figure>\n<p>The pie chart made it clear that the switches, the pcb, and the stm32 mcu all took up a considerable amount of cost, and could stand to be optimized. This pie chart also confirmed to me that there was some value in swapping over the MCU, since it meant I could save roughly ~$2 CAD both on the MCU and the voltage regulator, which is a significant portion of money if I was to target a price of $5.</p>\n<p>Another interesting observation was that the switches were the dominant factor in the price of the pusheenz40, which I thought was interesting.</p>\n<p>In order to target a hyper affordable keyboard, I made the following high level changes to the pusheenz40:</p>\n<ul>\n<li>Make the key spacing 9mm x 9mm\n<ul>\n<li>This was to make the pcb fit within 100mm x 100mm, since JLCPCB gives a special deal for pcbs that size or smaller.  Anecdotally speaking the special deal is material, since it roughly halves the cost of the pcb, at least when compared to boards slightly over 100mm x 100mm. </li>\n</ul>\n</li>\n<li>Swap to using a regular USB C port over a mid mount USB C port\n<ul>\n<li>The mid mount USB C costs considerably more, and requires standard PCBA (over economy PCB) from JLCPCB.</li>\n</ul>\n</li>\n<li>Use the CH552T MCU\n<ul>\n<li>Saves roughly 2 dollars as mentioned previously.</li>\n</ul>\n</li>\n<li>Use G-Switch <a href=\"https://www.lcsc.com/product-detail/Tactile-Switches_G-Switch-GT-TC063F-H035-L30_C963195.html\">GT-TC063F-H035-L30</a> SMD switches\n<ul>\n<li>These switches were slightly cheaper than the panasonic <a href=\"https://www.lcsc.com/product-detail/Tactile-Switches_PANASONIC-EVQP0N02B_C713479.html\">EVQP0N02B</a> smd switches I previously used and very cheap at $0.17 CAD a switch. Also EVQP0N02B switches are sold out and need to be pre-ordered :(</li>\n<li>These switches will come to haunt me :(</li>\n</ul>\n</li>\n<li>Remove TVS protection and fuse\n<ul>\n<li>Somewhat controversial, but I wanted to see if I could get away with omitting said protection components, since I noticed some CH552 dev boards also lacked protection components.\n<ul>\n<li>After some consultation in the Low Profile Keyboards discord, it seemed like omitting the fuse might be okay given the current draw of the other components, though having a TVS diode was something that was recommended to leave in.\n<ul>\n<li>In future designs, I plan to add the TVS diode back in just to err on caution, especially given how cheap it is relative to the rest of the components.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Reduce the amount of keys down from 40 to 32\n<ul>\n<li>The pie chart made it clear that the majoriy of the cost of a keyboard is in it's switches. As such, reducing the amount of switches by 8 saved 8*$0.17 = $1.36 dollars.</li>\n<li>I thought 32 keys was an ideal number for a sub-40 key keyboard, since I could have 26 keys for the full alphabet, in addition to 6 thumb keys.</li>\n</ul>\n</li>\n</ul>\n<p>After the following optimizations, the theorhetical cost pie chart became the following</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/image.webp\" alt=\"Pie chart of the cost optimized idawgz32. Hastily made in Apple Numbers\" width=\"719\" height=\"513\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/image-xs.webp 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/image-sm.webp 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/image-md.webp 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/image-lg.webp 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/image-xl.webp 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/image-2xl.webp 1600w\">\n<figcaption >Pie chart of the cost optimized idawgz32. Hastily made in Apple Numbers</figcaption>\n</figure>\n<p>With fairly aggresive optimizations, I was able to take the rough cost of a pusheenz40 down from $14.57 CAD to $6.56 CAD. Here again that despite being 32 keys now, the cost of switches continue to dominate the cost of the board, and are probably the sole cost limiting factor at this point.</p>\n<p>In order to make the hy<span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">pothetical keyboard less than 5 dollars, I had to perform one final trick</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/Screenshot-2024-02-25-at-6.47.14-PM.png\" alt=\"6.56 CAD is 4.86 US dollars\" width=\"976\" height=\"575\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot-2024-02-25-at-6.47.14-PM-xs.png 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot-2024-02-25-at-6.47.14-PM-sm.png 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot-2024-02-25-at-6.47.14-PM-md.png 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot-2024-02-25-at-6.47.14-PM-lg.png 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot-2024-02-25-at-6.47.14-PM-xl.png 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/Screenshot-2024-02-25-at-6.47.14-PM-2xl.png 1600w\"></figure>\n<p>At time of writing, $6.56 CAD is $4.85 USD, giving me my $5 keyboard. Thank you Canadian economy :))</p>\n<h1>Recieving the boards and using FAK</h1>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/PXL_20240225_224453990.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_224453990-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_224453990-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_224453990-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_224453990-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_224453990-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_224453990-2xl.jpg 1600w\"></figure>\n<p>Once the design was done I sent my board off to JLCPCB to be manufactured. The merchandise cost ended up being 54.15 CAD, which for 5 boards works out to roughly $8 USD. I think this is still roughly reasonable given that I am using JLC's PCB assembly services rather than assembling the boards myself, and given that these costs can be greatly amortized if I ordered a bigger quantity, like 30.</p>\n<p>When the boards arrived I was pretty happy with the result. The tactile switches felt decent enough, and I thought it was pretty funny that the size of the board was approaching that of a credit card.</p>\n<p>The biggest risk at this point was using FAK itself. I was cautiously optimistic of FAK, because I've had bad run ins with smaller keyboard firmware projects in the past. Of the prior keyboard firmwares I tried until that point, I found one of them to be missing some features required for a 40 key keyboard and being a bit too low level for my tastes (skill issue on my end I suppose), and another to have a considerable amount of bugs, as well as documentation, code, and coding standard issues. The other two firmwares were QMK and ZMK.</p>\n<p>To my surprise, I ended up liking FAK a lot, and I was surprised how feature rich it was from the box (hold-tap support, mod tap keys, magicboot, tap dance, etc.). Once I wrangled with getting the dependencies set up on my Macbook, it was off to the races with playing around with FAK and flashing the firmware onto my board. I had zero blocking issues taking my intermediate 40 key QMK layout and effectively recreating it in FAK.</p>\n<p>I think one of the coolest things about FAK is how it uses <a href=\"https://nickel-lang.org/\">Nickel</a> to convert the configuration down into low level C code. From an end user standpoint, it surprised me how much rich configuration you can set up while still having it all being able to run on the relatively resource constrained CH552 chip.</p>\n<p>One thing I'd like to see in the future from Nickel is a better debug story when it comes to type errors. Sometimes when changing a layout you can get the following message (or simillar)</p>\n<pre><br><code class=\"scrollbarGhostHairline_c9a45f scrollbar_d66c5e codeView__8b1ff hljs txt\">Evaluating Nickel files...\nerror: contract broken by the value of `layers`\n    ┌─ /home/username/Keyboards/fak/ncl/fak/keymap.ncl:193:14\n    │\n193 │     layers | Layers,\n    │              ------ expected type\n    │\n    ┌─ /home/username/Keyboards/fak/ncl/kazik/keymap.ncl:9:5\n    │  \n  9 │ ╭     [\n 10 │ │       kc.Q,     kc.W,     kc.E,     kc.R,     kc.T,     kc.Y,     kc.U,     kc.I,    kc.O,     kc.P,\n 11 │ │       kc.A,     kc.S,     kc.D,     kc.F,     kc.G,     kc.H,     kc.J,     kc.K,    kc.L, \n 12 │ │       kc.Z,     kc.X,     kc.C,     kc.V,     kc.B,     kc.N,     kc.M,     kc.SLSH, kc.RSFT,\n 13 │ │       kc.LCTL,  kc.LALT,  kc.SPC,   kc.BSPC,  kc.RALT,  kc.RCTL\n 14 │ │     ],\n    │ ╰─────' evaluated to this expression</code></pre>\n<p>While it's great that Nickel is highlighting that there is a typing issue in the configuration, it's not clear why the typing is failing, and often requires a thorough search through the typing. In contrast, languages like Typescript are pretty good when telling you when a type definition is broken, since it drills down to tell you exactly what field is incorrect when assigning a value to a type. This is a surface level <span class=\"yKMVIe\" role=\"heading\" aria-level=\"1\">criticism</span> of Nickel though, and not one about FAK itself.</p>\n<h1>A tradgedy in the switches</h1>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/PXL_20240225_201119535.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_201119535-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_201119535-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_201119535-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_201119535-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_201119535-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_201119535-2xl.jpg 1600w\"></figure>\n<p>Once I had the firmware set up, I was off to the races with monkeytype. From there however, the greatest flaws of the board was revealed; the switches. The G-Switch GT-TC063F-H035-L30 had greater travel than the Panasonic EVQP0N02B switches I was used to, and required a higher level of force to actuate at 70gf. These two factors combined made it more cumbersome to type on. This in conjunciton with the new 32 key layout and 9mm spacing reduced my wpm down from 100 wpm peak to maybe 83 wpm peak.</p>\n<p>Additionally, the keyboard felt considerably more scratchy than the pusheenz40, since the key buttons moved up and down more due to the greater travel, and had more opportunity to get stuck and caught on the 3d printed case. Thankfully I found applying Krytox to the key buttons helped the scratchyness considerably.</p>\n<p>Unfortunately, the final nail in the coffin for these swtiches were their reliability. I noticed that some keys didn't register unless I pressed fairly hard on them, even after they made a tactile click. At first I wondered if the firmware or pcb had some issue with noise and bouncing, but after a few afternoons of debugging, I confirmed that the problem did seem to be coming from the switch itself. </p>\n<p>Of the 5 PCBAs I had, all 5 of them had 1-5 defective swtiches that wouldn't register unless pressing well beyond it's tactile event or if pressing it at an certain angle. The best fix I can come up with so far is transplanting the silicone membrane and click disc of the a working button to a defective one. Unfortunately, while about as barbaric and naive as a plague doctor treatment, it does seem to be a semi-reliable means of fixing the issue. I suspect the issue might either be with misalginment of the click disc, the quality of the click disc or key membrane, or both.</p>\n<p>Regardless of the issue, the defect rate is unacceptable, and unfortunately means that this current batch won't be something I'll want to give away. I plan to create a new idawgz32 revision using the tried and true EVQP0N02B once my pre-order of them is completed.</p>\n<h1>Conclusion</h1>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/PXL_20240225_225159875-2.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_225159875-2-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_225159875-2-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_225159875-2-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_225159875-2-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_225159875-2-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/responsive/PXL_20240225_225159875-2-2xl.jpg 1600w\"></figure>\n<p>In conclusion, while these prototypes cannot be given away due to defects in the switches, they helped confirm a lot of experimental questions I had. Primarily, they confirmed that a 32 key layout is viable for me, as well as validating that FAK is usable for my current and future layouts. Finally, they confirmed that it is possible to produce and entire board with swtiches for roughly $5-$6 without having to bank on economies of scale or obscure manufacturing processes.</p>\n<p>In terms of design, I'm happy that I plotted all of the costs out into a pie chart before deciding what to cut. I think it allowed me to make holistic decisions about the design and prevented me from hyperfocusing and wasting time on diminishing returns for any given dimension. I'll adopt a similar approach for future budget projects going forward.</p>\n<p>One surprising realization that came out of the process was the discovery that the switches are by far the most domininant cost factor for any given mechanical keyboard, barring a fancy metal CNC'd case. Even for a 40 key STM32 board with a decent amount of trimmings, the keys took up the majority of the cost of a keyboard. The revelation to me is that hyper-cost-optimized boards need to focus on the switch price and/or the switch count for them to truly succeed. Other optimizations simply will not matter if the price of the switches are not kept in check.</p>\n<p>I look forward to making a v2 of this board where I can use the panasonic switches to hopefully address all of the major issues with the board. Hopefully then I can have a tiny board that I can both daily drive and give out like candy.</p>\n<h1>Acknowledgements</h1>\n<p>Thank you <a href=\"https://shop.beekeeb.com/\">BeeKeeb</a>, <a href=\"https://talpkeyboard.net/\">TALPKEYBOARD</a>, and <a href=\"https://kurihara.hatenadiary.jp/\">kurihara</a> for being recurring sponsors on <a href=\"https://github.com/ChrisChrisLoLo\">Github</a> and <a href=\"https://ko-fi.com/sporewoh\">ko-fi</a>, as well as to all those who have donated!</p>\n<p>I am very grateful to have a community of people who enjoy my work as much as I do. With your support I'm able to keep making these hyper experimental boards, and learn a lot and document it along the way. If you found this project and process interesting, informative, or useful, or like to see me make more projects similar to this, please consider supporting me on Github or ko-fi!</p>\n<p>Another big thank you to <a href=\"https://github.com/semickolon\">semickolon</a> for doing an incredible job with FAK, as well as for the firmware help and support. semickolon's also working on a new, exciting firmware that will be able to work with wireless RISC-V chips! If you're interested, check out his discord <a href=\"https://discord.gg/4Ev8GFZNR2\">here</a>! </p>\n<p>If interested in my other projects, feel free to check out my discord <a href=\"https://discord.gg/m8vwnqJEsc\">here</a>!</p>",
            "image": "https://chrischrislolo.github.io/orthoLabLogs/media/posts/9/PXL_20240225_225159875.jpg",
            "author": {
                "name": "sporewoh"
            },
            "tags": [
                   "keyboard"
            ],
            "date_published": "2024-02-25T15:14:18-06:00",
            "date_modified": "2024-02-26T07:53:30-06:00"
        },
        {
            "id": "https://chrischrislolo.github.io/orthoLabLogs/pusheenz40.html",
            "url": "https://chrischrislolo.github.io/orthoLabLogs/pusheenz40.html",
            "title": "pusheenz40 (how I found the perfect SMD key switch)",
            "summary": "Purpose: Talk about my latest keyboard, the pusheenz40, as well as the SMD switches it uses. Addtionally cover the design process to make keycaps for the SMD switches. My last pocket keyboard, the modkipz40, was a board that I was fairly satisfied with. It was&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/PXL_20240128_191510082.jpg\" alt=\"Picture of the pusheenz40\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240128_191510082-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240128_191510082-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240128_191510082-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240128_191510082-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240128_191510082-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240128_191510082-2xl.jpg 1600w\"></figure>\n<h2>Purpose:</h2>\n<p>Talk about my latest keyboard, the <a href=\"https://github.com/ChrisChrisLoLo/pusheenz40\">pusheenz40</a>, as well as the SMD switches it uses. Addtionally cover the design process to make keycaps for the SMD switches.</p>\n<h2>Problem:</h2>\n<p>My last pocket keyboard, the <a href=\"https://chrischrislolo.github.io/orthoLabLogs/modkipz40-how-i-used-ergogen-for-the-first-time.html\" target=\"_blank\" rel=\"noopener noreferrer\">modkipz40</a>, was a board that I was fairly satisfied with. It was both pretty comfortable on my wrists, and looked pretty decent as well. However, it still had a minor pain point of the kailh mute switches I was using. The switches were a bit tricky to type on given their small size, and a bit uncomfortable to type on as well for prolonged periods of time. It also made the board a tad bit thicker than I thought it could be.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/PXL_20240129_0155080381.jpg\" alt=\"modkipz40 image\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240129_0155080381-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240129_0155080381-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240129_0155080381-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240129_0155080381-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240129_0155080381-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20240129_0155080381-2xl.jpg 1600w\"></figure>\n<p>Ideally, I could make something that was a bit thinner and a bit more confortable to use. Initially, the idea of having the keyboard just consist of a pcb and be the thickness of a credit card also excited me.</p>\n<h2>Solution:</h2>\n<p>When browsing for potential mouse switches to use for my pocket boards, I stumbled upon the panasonic EVQP0N02B, an SMD switch that was used in some Microsoft and Xiaomi mice.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/20230203_PANASONIC-EVQP0N02B_C713479_front.jpg\" alt=\"\" width=\"900\" height=\"900\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20230203_PANASONIC-EVQP0N02B_C713479_front-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20230203_PANASONIC-EVQP0N02B_C713479_front-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20230203_PANASONIC-EVQP0N02B_C713479_front-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20230203_PANASONIC-EVQP0N02B_C713479_front-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20230203_PANASONIC-EVQP0N02B_C713479_front-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20230203_PANASONIC-EVQP0N02B_C713479_front-2xl.jpg 1600w\"></figure>\n<p>This switch really interested me because it was low profile, SMD, and available on LCSC. It being low profile meant I could have a board that was ultra thin as the switches would no longer be the limiting factor. It being SMD meant that I also didn't have to worry about the pokey through hole bits, which take up vertical space (and also opens the door to having, say, a lipo battery on the other side of the pcb). It being on LCSC meant I could hypothetically have a \"zero-assembly\" keyboard since it could just be assembled for me through JLCPCB. This biggest downside on paper was that the durablility rating for these switches was only 1 milion actuations, which is 2 million less than what's stated for kailh mute switches. I still thought that 1 million was both considerably more than other tactile switches, and should be sufficient for the sake of this keyboard, assuming the lifetime of this board goes down to maybe a couple of years of frequent use.</p>\n<p>I basically took the modkipz40 pcb, swapped in the smd footprint in, and sent the order off to JLCPCB. This meant the keyboard would still be using the awesome STM32F072C8Tx MCU</p>\n<h2>Initial Thoughts:</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/PXL_20231229_164239394.jpg\" alt=\"a pusheenz40 pcb\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231229_164239394-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231229_164239394-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231229_164239394-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231229_164239394-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231229_164239394-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231229_164239394-2xl.jpg 1600w\"></figure>\n<p>I was pretty excited when the pcb came in! I added a topology graphic to the pcb's silkscreen, and I thought it looked pretty nice! I was exited to try the keyboard pcb as-is, in the hope of having an ultra flat creditcard thickness board. However, I got pretty disappointed when trying to type on the board. I got roughly words per minute in the 30s in monkeytype, which was less than half then that of what I get with the modkipz40. Worse yet, the thumb keys <em>hurt</em> like crazy, since my thumbs ended up jamming into the sharp metal corners of the switches more often than not. It was clear to me that as-is, this board wouldn't be viable, and that I would have to add some sort of keycap to make typing on this possible</p>\n<h2>Developing custom keycaps:</h2>\n<p>In my initial attempts of the <a href=\"https://chrischrislolo.github.io/orthoLabLogs/bunchiez40-how-i-built-a-keyboard-using-mouse-switches.html\" target=\"_blank\" rel=\"noopener noreferrer\">bunchiez40</a> and <a href=\"https://chrischrislolo.github.io/orthoLabLogs/modkipz40-how-i-used-ergogen-for-the-first-time.html\" target=\"_blank\" rel=\"noopener noreferrer\">modkipz40</a>, I had tried to make my own 3D printed buttons to go ontop of of the kailh buttons. The biggest issue by far is that these switches have no keycap stem, so there's no easy way of attaching any form of keycap onto the switche. Other big issues was that it was really difficult coming up with a design that was easily 3D printable, and reliable. I had several iterations of switches that were joined together to the keyboard case, and used some form of compliant mechanism as a means of movement. All iterations ended up failing for several reasons, some of them being that they introduced too much height to the board, or because they were near impossible to produce well. I ended up abandoning the idea in favour of typing on the kailh switches directly.</p>\n<p>During my research process, I wanted to figure out how a kailh mute switch acutally worked, and tore one down.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/PXL_20231016_232356702.jpg\" alt=\"clipped kailh mute switche\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232356702-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232356702-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232356702-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232356702-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232356702-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232356702-2xl.jpg 1600w\">\n<figcaption >Kailh switch that I clipped to tear open. RIP 2023-2023</figcaption>\n</figure>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/PXL_20231016_232134804.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232134804-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232134804-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232134804-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232134804-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232134804-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232134804-2xl.jpg 1600w\">\n<figcaption >Red slider slides along the rails of the bottom housing</figcaption>\n</figure>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/PXL_20231016_232602493.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232602493-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232602493-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232602493-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232602493-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232602493-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/PXL_20231016_232602493-2xl.jpg 1600w\">\n<figcaption >In order: the connective leads and bottom housing, the metal button disc, the grey membrance, the black top housing, and the red cap</figcaption>\n</figure>\n<p>The teardown proved to be exceptionally informative, since it broke down what was required for a switch of this size. As seen in the third picture, the red \"cap\" has a sliding piece sticking out that slides along the rails of the grey body, and is held in place by the black top case. The red cap can depress the grey silicon membrane, which can cause the metal disc to collapse in to make an connection with the two metal leads. These components are very similar to that of the joycon buttons as well.</p>\n<p>The most interesting observation in my mind was that the SMD buttons I had effectively act as the bottom 3 components of the switch. If I designed and added my own caps and top housing, then I'd effectively have my own \"complete switch\" that should be much easier to type on. The best part is that if I make the cap and top housing myself, I can tweak it to my liking, and tune it's size and height to my hearts content.</p>\n<p>I used ergogen to make a new case for my board. Most notably, I added in \"slider rails\" to my cases integrated plate, so that the entire top plate could act as a slider and a top housing for my switches. From there I made caps similar to that of the kailh mute switch: generally cylindrical with knubs on each end that could fit into the sliders.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/Screenshot-2024-01-28-at-8.41.19-PM.png\" alt=\"\" width=\"1602\" height=\"1051\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2024-01-28-at-8.41.19-PM-xs.png 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2024-01-28-at-8.41.19-PM-sm.png 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2024-01-28-at-8.41.19-PM-md.png 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2024-01-28-at-8.41.19-PM-lg.png 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2024-01-28-at-8.41.19-PM-xl.png 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2024-01-28-at-8.41.19-PM-2xl.png 1600w\">\n<figcaption >Case. Note the rails for each of the key holes.</figcaption>\n</figure>\n<h2>Results:</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/20240128_131943.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20240128_131943-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20240128_131943-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20240128_131943-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20240128_131943-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20240128_131943-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/20240128_131943-2xl.jpg 1600w\"></figure>\n<p>After several iterations of refining the tolerances, such that the keycaps were neither sticky nor needlessly wobbly, I was able to make something I'm very happy with! I had to use the finest settings on my P1S 3D printer, but I was able to make something that was both very comfortable and relatively easy to type on! My fingertips no longer hurt and my wpm was able to spring back to to 80+ wpm. I was even able to get 100+ wpm on this board.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/Screenshot-2023-12-27-at-11.32.16-AM.png\" alt=\"my monkeytype wpm of 100 :)\" width=\"913\" height=\"668\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2023-12-27-at-11.32.16-AM-xs.png 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2023-12-27-at-11.32.16-AM-sm.png 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2023-12-27-at-11.32.16-AM-md.png 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2023-12-27-at-11.32.16-AM-lg.png 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2023-12-27-at-11.32.16-AM-xl.png 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/responsive/Screenshot-2023-12-27-at-11.32.16-AM-2xl.png 1600w\"></figure>\n<p>The screenshot itself isn't definitive proof for a skeptic, but you'll have to take my word on this one until I do a proper typing test :). I hope the image atleast is illustrative that typing on this board is viable for daily driving.</p>\n<p>The board is also super thin at around 8mm. In fact, it might almost be <em>too</em> thin given that a small part of my wrist bone rubs against my desk a bit. Not enough to cause carpel tunnel strain, but enough that I wouldn't mind if I went a couple millimeters higher.</p>\n<h2>Future Plans:</h2>\n<p>I think the idea of SMD switches is really exciting, since it opens up a <em>ton</em> of real estate on a pcb, and can reduce a lot of work required assembling a board, since it can mean that no soldering is required. The two most interesting projects that could result from this is either a board with a lipo at the back of it, or a board that's cheap and easy to produce and distribute.</p>\n<h2>Acknowledgments:</h2>\n<p>Huge thank you to BeeKeeb, TALPKEYBOARD, and kurihara for sponsoring me on <a href=\"https://github.com/ChrisChrisLoLo\">Github</a> and <a href=\"https://ko-fi.com/sporewoh\">ko-fi</a>!! These fun experimental builds wouldn't be possible without your generous support, and let me keep pushing the boundaries of keyboard design. If you found this project interesting or informative, or like to see me make more projects similar to this, please consider supporting me on Github or ko-fi!</p>\n<h2> </h2>",
            "image": "https://chrischrislolo.github.io/orthoLabLogs/media/posts/8/PXL_20240128_191510082-2.jpg",
            "author": {
                "name": "sporewoh"
            },
            "tags": [
                   "keyboard"
            ],
            "date_published": "2024-01-28T19:13:54-06:00",
            "date_modified": "2024-01-28T22:57:25-06:00"
        },
        {
            "id": "https://chrischrislolo.github.io/orthoLabLogs/modkipz40-how-i-used-ergogen-for-the-first-time.html",
            "url": "https://chrischrislolo.github.io/orthoLabLogs/modkipz40-how-i-used-ergogen-for-the-first-time.html",
            "title": "modkipz40 (how I used ergogen for the first time)",
            "summary": "Purpose: Discuss how I made the modkipz40, my new \"ergonomic\" pocket board that uses mouse switches. Talk about my first experience using ergogen, it's advantages and drawbacks, as well how this project shifted my view on keyboard ergonomics. I thoroughly enjoyed making and using my&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/PXL_20231210_225209197.NIGHT.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_225209197.NIGHT-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_225209197.NIGHT-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_225209197.NIGHT-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_225209197.NIGHT-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_225209197.NIGHT-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_225209197.NIGHT-2xl.jpg 1600w\"></figure>\n<h2>Purpose:</h2>\n<p>Discuss how I made the modkipz40, my new \"ergonomic\" pocket board that uses mouse switches. Talk about my first experience using ergogen, it's advantages and drawbacks, as well how this project shifted my view on keyboard ergonomics.</p>\n<h2>Problem:</h2>\n<p>I thoroughly enjoyed making and using my <a href=\"https://chrischrislolo.github.io/orthoLabLogs/bunchiez40-how-i-built-a-keyboard-using-mouse-switches.html\">bunchiez40</a> keyboard, which was the first board of mine to use mouse switches (that is, the buttons that you can find in computer mice). I like this kind of board so much that I've come up with a new term for its kind: pocket board.</p>\n<p>However, one of the biggest issues with the board for me was its tight key spacing. Ironically, the issue though was not with typing speed, but rather the ulnar deviation that occurred when I was typing on the board. This occurred because I had to move my hands closer together.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/PXL_20231122_0342034091.jpg\" alt=\"\" width=\"3072\" height=\"4080\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231122_0342034091-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231122_0342034091-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231122_0342034091-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231122_0342034091-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231122_0342034091-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231122_0342034091-2xl.jpg 1600w\"></figure>\n<p>My wrists started to hurt after extended typing sessions, both due to what I think is compression of the ulnar tunnel, as well as compression of the carpal tunnel. I was generally able to over come the carpal tunnel compression by assuming a proper typing form that didn't compress my wrists against the table (along with proper wrist streching before hand). However, my ulnar tunnel still ached considerably, meaning I needed to develop a new pocket board to account for this before I caused any permanent strain and damage to my wrists. </p>\n<h2>Solution:</h2>\n<p>The solution to reducing ulnar deviation in the keyboard world is generally to angle the the halves of the board such that the hand is relatively parallel with the rest of the arm, such that the wrist doesn't have to deviate much from it's resting position. This would mean I would have to tilt the two haves of the keyboard inwards to reduce any ulnar deviation.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://samarpanphysioclinic.com/wp-content/uploads/2023/06/radial-_-ulnar-Deviation-1200x1109.webp\" alt=\"Radial And Ulnar Deviation Of The Wrist - Movement, Muscles, ROM\" width=\"414\" height=\"382\" aria-hidden=\"false\" data-is-external-image=\"true\"></figure>\n<p>The most widely used tool in the community to make boards like this would be Ergogen. Ergogen's biggest strength is that it creates vectors of a keyboards shape based on the YAML fed into it. The YAML configuration allows for ergonomic keyboard shapes, since it's easy to define key spacing, key/column angles, and any offsets desired.</p>\n<h2>My experience with Ergogen:</h2>\n<p>I had previously tried to use Ergogen to make my first project years ago (specifically for the <a href=\"https://github.com/ChrisChrisLoLo/youwu36\">youwu36</a>). The two biggest issues with it I found though, were that I was trying to use it as a crutch as an alternative to understanding KiCad (as I didn't know how to fully use KiCad at the time), and that I found the <a href=\"https://docs.ergogen.xyz/\">documentation</a> tricky to parse. At time of writing, I still find it hard to understand how certain examples in the docs fit into the larger picture of making a keyboard (it can read more like an API sheet than a guide), and examples in the Outlines section weren't loading altogether.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/Screenshot-2023-12-18-at-12.09.40-AM.png\" alt=\"\" width=\"1028\" height=\"790\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.09.40-AM-xs.png 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.09.40-AM-sm.png 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.09.40-AM-md.png 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.09.40-AM-lg.png 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.09.40-AM-xl.png 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.09.40-AM-2xl.png 1600w\"></figure>\n<p>Upon revisting Ergogen years later to try to use it for this project, I stumbled upon this <a href=\"https://flatfootfox.com/ergogen-introduction/\">guide</a> by FlatFootFox. I think this guide is awesome, since it nicely structures Ergogen concepts into a logical sequence, provides detailed information on what each snippet of YAML is doing, and most importantly, provides clear holistic examples of what you can do with Ergogen. This is an awesome guide that allowed me to quickly whip up exactly what I wanted in terms of outlines. I was able to generate the shape of the PCB, plate, and case all in a single vector outline.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/Screenshot-2023-12-18-at-12.26.03-AM.png\" alt=\"\" width=\"975\" height=\"612\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.26.03-AM-xs.png 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.26.03-AM-sm.png 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.26.03-AM-md.png 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.26.03-AM-lg.png 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.26.03-AM-xl.png 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.26.03-AM-2xl.png 1600w\"></figure>\n<p>I used the outline in KiCad by importing the DXF and then setting the outer lines to edgecuts to define the PCB shape. I also used the YAML in conjunction with the <a href=\"https://github.com/adamws/kicad-kbplacer\">kicad-kbplacer</a> plugin to set the switch positions.</p>\n<p>To make the case, I used the DXF in Fusion360 by importing the outline file and then selecting the shapes I wanted to extrude. Extruding the shapes allowed me to easily both make the bottom half and top half of the case relatively parametrically.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/Screenshot-2023-12-18-at-12.34.14-AM.png\" alt=\"\" width=\"1502\" height=\"899\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.34.14-AM-xs.png 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.34.14-AM-sm.png 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.34.14-AM-md.png 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.34.14-AM-lg.png 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.34.14-AM-xl.png 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-12.34.14-AM-2xl.png 1600w\"></figure>\n<p>For KiCad and Fusion, while I am happy with the final result, I do wonder if I can refine the creation process a bit in the future. In KiCad, I had to manually shift the grid of switches onto the PCB, which was time consuming and somewhat imprecise (I understand that Ergogen has an ability to export KiCad files, though I wasn't sure how to get it to easily use the mouse switch footprints I needed to use). For Fusion, the model is only partially parametric; any changes in the Ergogen file meant a new DXF file, which means I would have to redo or reassociate a good chunk of extrusions and steps there after.</p>\n<h2>Results:</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/PXL_20231210_224330513.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_224330513-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_224330513-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_224330513-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_224330513-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_224330513-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/PXL_20231210_224330513-2xl.jpg 1600w\"></figure>\n<p>After assembly, I was happy to find that the angled keys significantly improved the comfort of my wrists, even though the rotation angle was at a modest 10 degrees. I can now type all day without any sort of discomfort from my ulnar tunnel. My typing speed has also improved. On a good day I'm now able to type at about ~95 wpm on monkeytype with this board. This is roughly a ~10 wpm gain from the bunchiez40. I'm not entirely sure if this is due to the \"ergonomics\" of the pocket board, the new huano black mute switches I'm using, or because of the practice I've accumulated typing on these keys. In any case, this board is viable for everyday use, and I don't feel like it's much of a bottleneck in terms of converting my thoughts into keystrokes.</p>\n<p>Ultimately I'm very happy I spent the time to learn how to make an ergonomic board. Not only does it give me more creative flexibility to make something comfortable and aesthetically pleasing, but I think with a bit more practice it can potentially speed up my current keyboard design workflow, just due to how easy it is to specify both PCB and case outlines in a single file.</p>\n<h2>Future Plans:</h2>\n<p>I think this keyboard is comfortable enough for me to daily drive (I'm currently using it to write this blog post), though I still think there can be room for improvement. In particular, I'd like the switches to be lower profile to reduce wrist extension. I'd also like to see if I can reduce the actuation force in an attempt to require less force when typing. The two biggest switches I'd like to experiment with as a resuilt would be the 4.3mm Huano/Kailh mute switch, as well as the Panasonic EVQPO/EVQQ2 SMD light touch switch. </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/Screenshot-2023-12-18-at-1.10.00-PM-2.png\" alt=\"\" width=\"244\" height=\"153\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-1.10.00-PM-2-xs.png 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-1.10.00-PM-2-sm.png 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-1.10.00-PM-2-md.png 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-1.10.00-PM-2-lg.png 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-1.10.00-PM-2-xl.png 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/5/responsive/Screenshot-2023-12-18-at-1.10.00-PM-2-2xl.png 1600w\"></figure>\n<p>I think either kind of switch should be slightly more comfortable, and the idea of using SMD switches is exciting, since it means I can put other components on the back of the PCB (such as a battery or the like).</p>\n<h2>Conclusion:</h2>\n<p>I had a lot of fun making the modkipz40, since it required me to learn basic wrist ergonomics and anatomy, as well as pick up the popular Ergogen tool that all the cool kids are using. There's some sort of irony that my tiny boards forced me to understand and appretiate the basics of keyboard ergonomics. I certainly plan to use Ergogen more for future projects, and I'm excited that there's still room for exploration with my pocket boards.</p>\n<h2>Acknowledgments:</h2>\n<p>Big thank you to BeeKeeb and kurihara for sponsoring me on <a href=\"https://github.com/ChrisChrisLoLo\">Github</a> and <a href=\"https://ko-fi.com/sporewoh\">ko-fi</a>. Your generous contributions help me to continue to experiment and iterate on weird new board designs like this, and allow me to continue to do what I love. </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "sporewoh"
            },
            "tags": [
            ],
            "date_published": "2023-12-12T20:44:01-06:00",
            "date_modified": "2023-12-19T01:09:20-06:00"
        },
        {
            "id": "https://chrischrislolo.github.io/orthoLabLogs/bunchiez40-how-i-built-a-keyboard-using-mouse-switches.html",
            "url": "https://chrischrislolo.github.io/orthoLabLogs/bunchiez40-how-i-built-a-keyboard-using-mouse-switches.html",
            "title": "bunchiez40 (how I built a keyboard using mouse switches)",
            "summary": "Objective: bunchiez40 is my new tiny keyboard that uses unique switches to achieve it's form factor while still making it viable to type 85+ wpm on. In this log, I will discuss my cool new keyboard, how I got to this point, as well as&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/PXL_20231127_0442554541-2.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_0442554541-2-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_0442554541-2-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_0442554541-2-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_0442554541-2-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_0442554541-2-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_0442554541-2-2xl.jpg 1600w\"></figure>\n<h1>Objective:</h1>\n<p>bunchiez40 is my new tiny keyboard that uses unique switches to achieve it's form factor while still making it viable to type 85+ wpm on.</p>\n<p>In this log, I will discuss my cool new keyboard, how I got to this point, as well as future plans about this new exciting direction.</p>\n<h1>Problem:</h1>\n<p>I hit a hard limit. Over past year or so, I've been shrinking down the size of my keyboard. What started out as a limitation of the 3D printer bed size has now become an obsession in terms of optimizing simply for the sake of being able to do so. The normal dimensions of a choc spaced swith is 18mm x 17mm. With my bancouver40, I had bumped the spacing down to 17mm x 17mm using CFX keys. With my hampsterz40 (to be publicly released), I further reduced the spacing to 15mm x 15mm using custom designed and printed keycaps.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/PXL_20231111_004551298-2.jpg\" alt=\"\" width=\"3072\" height=\"4080\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231111_004551298-2-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231111_004551298-2-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231111_004551298-2-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231111_004551298-2-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231111_004551298-2-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231111_004551298-2-2xl.jpg 1600w\">\n<figcaption >Red keyboard is my bancouver40, the white keyboard below that is my hampsterz40</figcaption>\n</figure>\n<p>However, at this point, I hit the absolute limit I could possibly go in terms shrinking my 4x10 board, since the dimensions of the choc switch (and mx switch for that matter) itself was 15mm x 15mm. Any attempt at going smaller would lead to switch overlap and collisions. I had breifly considered streamlining the key count, but that would lead to a considerably larger spike in terms of usablility of my boards.</p>\n<h1>Research:</h1>\n<p>In order to get around this physical limit, I considered going a path seldom traveled and use a switch with a smaller footprint. At first all I wanted was something that I \"could type on\". I've soon come to learn that finding a switch alternative is trickier than that vague criteria alone. When doing initial research on the topic, a friend of mine sent me this article from 40 percent club:<a href=\"https://www.40percent.club/2016/09/mini-planck.html\"> https://www.40percent.club/2016/09/mini-planck.html</a>. The article entails the mini planck 2.0, which along with the pocket type, are the two most notable keyboards that both use a switch smaller than an MX switch, and both make use of tactile switches. The most notable thing about the article was the author's description about the type feel of the keys:</p>\n<blockquote>\n<p>Metal dome construction. Loud click. Typing on these are horrible. The pressure required for the 180 gram is more than any Cherry switch. The 130 gram is much less. The switch travel is less than 1mm. They would make a nice macro pad or maybe used on a game pad, but not good for touch typing.</p>\n</blockquote>\n<p>This was very insightful, since I took the actuation force of the switch for granted. The article also notes switch lifecycle, a metric almost never mentioned by switch manufacturers since it's generally a given that the switch lifespan will be around the 50 million actuation mark. It also gave me the impression that these kinds of boards are mostly novelty, and have very little chance of being used for even a day.</p>\n<p>When I did the rounds on LCSC, Aliexpress, and mouser to do some microswitch shopping, I found that almost every microswitch out there was generally awful as a key substitutes. Almost all of them had actuation forces in the 120-180 grams of force range (a standard mx switch is roughly 60-70). Most of them also had a paltry ~100,000 actuation lifetime, which was a tiny fraction to the 50 million that MX switches reportedly have. I gained an appretiation for the MX switch design, since it became very clear that a very large amount of work had to be spent to make a button/switch that was both comfortable to type on, as well as durable enough to be typed on.</p>\n<p>With that frame of mind, I conjured up thoughts of what other switches have similar uses to keyboard switches, and would hopefully have similar lifetimes and actuation forces. It finally dawned on me that mouse switches would be somewhat analogous to keyboard switches. After some digging around, I stumbled upon the kailh/huano mute mouse switch. The huano pink switch specifically reportedly has a lifetime of 10 million actuations, and has an actuation force of 70+-10g, both of which are relatively similar to an MX switch. I plan to do a second write up on the silent mouse switch variants, since I find them both interesting as well as very obtuse in terms of documentation.</p>\n<h1>Experiment:</h1>\n<p>I quickly whipped up a 4x10 board that made use of these mouse switches. I decided to space the keys apart so that the spacing was 10mm x 10mm, since it felt like my fingers could fit within that space with a quick caliper test. Since this was a fairly risky design, I opted to use a waveshare rp2040 board that I could easily hand solder on. I tossed on an OLED since I thought it would be fun to make use of the real estate used up by the rp2040 board. The spacing also gave my hands a tiny bit of breathing room.</p>\n<p>I hoped with the choice of switch and keyspacing allowed me to create a board that viable to type on using two hands.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/PXL_20231105_230039555.jpg\" alt=\"\" width=\"3072\" height=\"4080\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231105_230039555-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231105_230039555-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231105_230039555-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231105_230039555-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231105_230039555-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231105_230039555-2xl.jpg 1600w\"><figcaption>Assembled pcb of the bunchiez40 (sans OLED)</figcaption></figure>\n<h1>Results:</h1>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/PXL_20231122_034203409.jpg\" alt=\"\" width=\"3072\" height=\"4080\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231122_034203409-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231122_034203409-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231122_034203409-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231122_034203409-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231122_034203409-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231122_034203409-2xl.jpg 1600w\"></figure>\n<p>It works!! Kind of. My rough caliper math wasn't great, and my fingers are closer together than I expected. Additionally it's tricky typing on the raw key itself, since its easier to miss a key. The elephant in the room is ergonomics, which are abysmal. My hands are permanently semi-contracted, and partially strained in order to fit my fingers onto the board. The ulnar deviation is also pretty bad. If I don't sit and rest my wrists exactly as I should, then acute discomfort can appear in my wrists, which usually is a cue for me to take a long break from the board.</p>\n<p>Despite this though, I practiced enough to the point where I can get roughly 85-95 wpm on this keyboard, which is only a slightly slower than my usual speed on a choc board. I also developed a typing form that allows me to be able to daily drive this board without (forseeable) discomfort or injury. The keys are also fun to type on in terms of feel. They're both silienced and extremely tactile, giving it a feel similar to an extreme version of a boba U4 switch. The silence also makes it ideal for typing in a quiet public setting (assuming you can type fast enough on it, and be comfortable enough to be seen using it). I find this really exciting since to the best of my knowledge, this board is something novel in terms of it's \"viability\" and radically small form factor.</p>\n<p>I think going forward I want to increase the ergonomics a bit (mostly to just reduce ulnar deviation) and even shrink the design up a tiny bit more. Another thing I'd like to try is low profile mute switches (4.3mm height), since I think those can improve my wrist angle and make it even more comfortable to use for long periods of time.</p>\n<p>Ultimately I think I think there's a lot more I can explore here, which has really reinvigorated my enthusiam for making new boards. Up until some point at the middle of this year, it had felt to me that the medium had hit a creative plateau in a way, and it felt like there was nothing I could do that hasn't already been done before in some way shape or form. Now it feels like a whole new world in terms of possibilities and experiments. How can I make this board smaller? More ergonomic? How can I put keys on a switch that has such a tiny semblance of a stem? </p>\n<p>This experiment was in my mind a resounding success in terms of making a viable board smaller. As such, I conclude the first revision of my bunchiez40 by making an CNC aluminum case for my board :)</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/PXL_20231127_042843419.jpg\" alt=\"\" width=\"4080\" height=\"3072\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_042843419-xs.jpg 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_042843419-sm.jpg 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_042843419-md.jpg 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_042843419-lg.jpg 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_042843419-xl.jpg 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/4/responsive/PXL_20231127_042843419-2xl.jpg 1600w\"> </figure>",
            "author": {
                "name": "sporewoh"
            },
            "tags": [
                   "research",
                   "keyboard"
            ],
            "date_published": "2023-11-26T23:53:29-06:00",
            "date_modified": "2023-12-18T01:54:09-06:00"
        },
        {
            "id": "https://chrischrislolo.github.io/orthoLabLogs/my-thoughts-on-openscad-and-why-cad-as-code-is-cool.html",
            "url": "https://chrischrislolo.github.io/orthoLabLogs/my-thoughts-on-openscad-and-why-cad-as-code-is-cool.html",
            "title": "My thoughts on OpenSCAD &amp; Alternatives, and why CAD as code is cool",
            "summary": "Wowowow 3D cool Purpose: This article will talk about my opinions about OpenSCAD, alternatives, and CAD as code as a novice. I want to jot my thoughts down here, but I acknowledge that there's still room for me to find a better solution/workflow than what&hellip;",
            "content_html": "<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/2/several_grey_utah_teapots_falling_on_an_open_laptop__grassy_hill_background__rendered__computer_graphics__4k_1095699334.png\" alt=\"a bunch of teapots\" width=\"1152\" height=\"768\" sizes=\"100vw\" srcset=\"https://chrischrislolo.github.io/orthoLabLogs/media/posts/2/responsive/several_grey_utah_teapots_falling_on_an_open_laptop__grassy_hill_background__rendered__computer_graphics__4k_1095699334-xs.png 300w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/2/responsive/several_grey_utah_teapots_falling_on_an_open_laptop__grassy_hill_background__rendered__computer_graphics__4k_1095699334-sm.png 480w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/2/responsive/several_grey_utah_teapots_falling_on_an_open_laptop__grassy_hill_background__rendered__computer_graphics__4k_1095699334-md.png 768w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/2/responsive/several_grey_utah_teapots_falling_on_an_open_laptop__grassy_hill_background__rendered__computer_graphics__4k_1095699334-lg.png 1024w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/2/responsive/several_grey_utah_teapots_falling_on_an_open_laptop__grassy_hill_background__rendered__computer_graphics__4k_1095699334-xl.png 1360w ,https://chrischrislolo.github.io/orthoLabLogs/media/posts/2/responsive/several_grey_utah_teapots_falling_on_an_open_laptop__grassy_hill_background__rendered__computer_graphics__4k_1095699334-2xl.png 1600w\">\n<figcaption >Wowowow 3D cool</figcaption>\n</figure>\n<p><em>Purpose: This article will talk about my opinions about OpenSCAD, alternatives, and CAD as code as a novice. I want to jot my thoughts down here, but I acknowledge that there's still room for me to find a better solution/workflow than what I currently have.</em></p>\n<h2>The allure and drawbacks of OpenSCAD </h2>\n<p>Fusion360 is expensive. At $476 - $710 CAD a year, I could buy myself a new 3D printer rather than paying for a year of Fusion360. The monthly price of $90 also doesn't seem very appealing given how often I use CAD for my hobby. I also dislike alternative free cloud solutions since the terms and conditions can and will change if the company needs to increase revenue for the year. The logical conclusion then would be to find and use a free (in cost and in access) alternative.</p>\n<p>One option would be to learn and use FreeCAD, though the UI isn't super fun to work with, and there's times where I'd like to express my thoughts code, but am unable to do so. A common example would be creating a grid of objects, easy to represent in a couple of `for` loops, less obvious to do in CAD programs, though this may just be due to lack of familiarity in said programs.</p>\n<p>One very alluring option that came up was OpenSCAD, where all aspects of the 3D model are represented in code. While not everything has to be represented as code, I find it particularly useful for the following reasons:</p>\n<ul>\n<li>It's very easy copying and pasting features across projects</li>\n<li>Because you're forced to write everything in code, I find that my projects tend to be more parametric than in fusion, mostly because I don't have the escape hatch of directly modifying my feature.</li>\n<li>Coming from a software development background, writing code feels more confortable than finding the right UI/Tools that I need</li>\n<li>I make ortholinear keyboard cases in CAD, so the cases tend to be very simple geometrically speaking. Because of this it's very easy representing the keyboards as code</li>\n<li>Version control comes for free with git</li>\n</ul>\n<p>While I like OpenSCAD very much, there's several roadbumps I've had with it that prevent it from being perfect. While I've had some luck in mitigating some roadbumps, there's still points that I'm considering to be near dealbreakers with OpenSCAD.</p>\n<ul>\n<li>OpenSCAD is famously very slow when there's lots of boolean operations. Without optimization on my end, all of my otholinear board cases have plenty of said boolean operations. By default, it can take a few minutes to render even with my Mac M1 processor.\n<ul>\n<li>The dev/nightly release of OpenSCAD mostly mitigates against this with fairly good caching and optimization options</li>\n</ul>\n</li>\n<li>OpenSCAD uses the CGAL kernel, which doesn't very easily allow for fillets.\n<ul>\n<li>It's possible to use `hull` or `minkowski`, but it's quite frustrating having to go out of your way to write code that emulates fillets rather than just tossing on a `fillet` function</li>\n<li>One possibility is directly importing the direct OpenSCAD code into FreeCAD, and then adding fillets in that software.\n<ul>\n<li>Biggest annoyance is occasionally I hit errors trying to import OpenSCAD into FreeCAD</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>I don't think this is a fair point, but OpenSCAD doesn't have a free option for creating technical drawings easily, which is a bit of a downer for manufacturing\n<ul>\n<li>I think this can be mitigated by importing the feature into FreeCAD, and then working off of that</li>\n</ul>\n</li>\n<li>The most painful point: OpenSCAD cannot export STEP files directly\n<ul>\n<li>This means that CNC manufactering + OpenSCAD by default is a no-go</li>\n<li>Also possible to try to import the OpenSCAD into FreeCAD, though doing so makes me anxious as there's effectively a risk that the translation fails, and if it fails, it means that all the work you've spent will have been for nothing.</li>\n</ul>\n</li>\n</ul>\n<p>While there's potential mitigations for the pitfalls of OpenSCAD, there's enough here to make it a bit cumbersome if you want fillets and/or the ability to CNC objects. For some projects, this is fine, but for keyboard cases, it's harder to want to go down this route.</p>\n<h2>CascadeStudio</h2>\n<p>Some alternatives I've investigated was CascadeStudio and CADquery.</p>\n<p>CascadeStudio on paper is really nice, web browser environment, can export STEP files and easily do fillets thanks to it's underlying OpenCascade Brep kernel. While I personally preferred the declarative nature of OpenSCAD, using JS was fine. It even had cool features like using the VSCode text editor (Monaco) and intellisense.</p>\n<p>The biggest issue I found with CascadeStudio is that it's horrible at error handling at all levels. If you accidentally passed in bad inputs (like an empty array) into CascadeStudio, it would bubble up the error message in the library without any context as to what caused the direct error to begin with. On top of this, it was also possible to have the OCCT webassembly fail and return an obtuse long integer error code. Compounded by the fact that there's no runtime type checking, using CascadeStudio eventually crawled to a halt, where each error I got forced me to undo the last three things I did in the hopes of fixing whatever the error was, since it was not remotely clear from the error message what went wrong.</p>\n<p>Furthermore performance wasn't very good either. The cache was horrible, since it caused it's fair share of issues itself, and usually had to be disabled to prevent piling onto any debugging mess.</p>\n<p>Ultimately while I think CascadeStudio does a lot of things right, I think it's biggest weakness is it's debuggability story. I think some easy wins for it would be adding basic input checking and error surfacing in it's functions. I'm not entirely sure what work would be involved in clarifying the long int errors that the opencascade.js kernel occasionally returns,though.</p>\n<h2>CadQuery</h2>\n<p>My best and last hope to an OpenSCAD alternative without coming up with external workflows would be CadQuery, a python library that also makes use of the OpenCascade kernel. CadQuery can also export STEP files and do fillets easily thanks to the kernel.</p>\n<p>My biggest gripes with CadQuery initially are generally bikeshed-y and opinionated. One gripe is that you need to use conda to install to CadQuery, which can mess up your computer in certain situations. Thankfully there's instructions on how to use mini mamba to avoid this issue. Another issue is that it's purely a python library, which I dislike, because in theory anything you write in CadQuery is now coupled to a CadQuery version AND a python runtime version. Generally I think this shouldn't be too bad if you stick to a generally small subset of python, but it's not something I'm a fan of. The last biggest gripe with CadQuery is it's syntax. While OpenSCAD and CascadeStudio generally had a nice functional syntax and flow to it, CadQuery opts to have a syntax similar to jQuery. From an onlookers point of view, the functions in CadQuery are not very clear as to what they return. CadQuery also seems to have a way of reletive references, so it's possible to perform operations relative to given geometries. I've read that this can both make certain operations relatively nice and very difficult, depending on what needs to be done.</p>\n<p>While the above has pushed me away from CadQuery, it is starting to look like potentially the best option of the three I have tried so far, and is something I want to try and hopefully adopt</p>\n<h2>Going forward</h2>\n<p>For now, I'm committing to trying CadQuery for my next enclosure and seeing how it goes. Ideally I can get past what I hope is superficial gripes with CadQuery and finally have a means of getting CNC ready models from code. If CadQuery gives me greif, the next thing to try might be going ahead with a solid OpenSCAD + FreeCAD workflow, or just begin to use FreeCAD entirely</p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "sporewoh"
            },
            "tags": [
            ],
            "date_published": "2023-10-29T00:47:25-05:00",
            "date_modified": "2023-10-29T16:18:22-05:00"
        },
        {
            "id": "https://chrischrislolo.github.io/orthoLabLogs/hello-wormhole.html",
            "url": "https://chrischrislolo.github.io/orthoLabLogs/hello-wormhole.html",
            "title": "HELLO WORMHOLE",
            "summary": "HELLO!!!!!!!!!!!!!!!!!!!!! This is my test post made with publii. It's very cool as a quick way to whip up blog posts. The current plan is to have all of my keyboard logs/findings/side projects here. Visibility will be low but this is mostly as a way&hellip;",
            "content_html": "<p>HELLO!!!!!!!!!!!!!!!!!!!!!</p>\n<p>This is my test post made with publii. It's very cool as a quick way to whip up blog posts.</p>\n<p>The current plan is to have all of my keyboard logs/findings/side projects here. Visibility will be low but this is mostly as a way to keep technical tabs and documentation on what I've been experimenting with. </p>",
            "author": {
                "name": "sporewoh"
            },
            "tags": [
            ],
            "date_published": "2023-10-25T21:54:06-05:00",
            "date_modified": "2023-10-29T00:23:58-05:00"
        }
    ]
}
